# Ablation config:
# refine shallow P2 features, then inject them back into the original P3 path
# with a learnable residual weight. P4/P5 stay on the original main path.

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]    # 9
  - [-1, 2, C2PSA, [1024]]      # 10

head:
  # Original YOLO11 OBB P3/P4/P5 path.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 16 (original P3/8)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 19 (original P4/16)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 22 (original P5/32)

  # Refined P2 branch: P2 -> 1x1 Conv -> CBAM -> downsample -> residual fuse into P3.
  - [16, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]] # 25 (P2/4 branch)
  - [-1, 1, Conv, [128, 1, 1]]  # 26
  - [-1, 1, CBAM, [7]]          # 27
  - [-1, 1, Conv, [256, 3, 2]]  # 28 align P2 branch back to P3 scale
  - [[28, 16], 1, ResidualCBFuse, [0.10]] # 29 P3_residual = P3 + alpha * F(P2)

  - [[29, 19, 22], 1, OBB, [nc, 1]] # Detect(P3_residual, P4, P5)
