# Ablation config:
# keep the original P3/P4/P5 three-head topology and add CBAM after each
# main FPN/PAN fusion stage, without introducing any P2 branch.

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]    # 9
  - [-1, 2, C2PSA, [1024]]      # 10

head:
  # Original YOLO11 OBB P3/P4/P5 path, with CBAM inserted after each fused stage.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 13
  - [-1, 1, CBAM, [7]]          # 14 refined top-down P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 17 (P3/8-small)
  - [-1, 1, CBAM, [7]]          # 18 refined P3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 21 (P4/16-medium)
  - [-1, 1, CBAM, [7]]          # 22 refined P4

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 25 (P5/32-large)
  - [-1, 1, CBAM, [7]]          # 26 refined P5

  - [[18, 22, 26], 1, OBB, [nc, 1]] # Detect(P3, P4, P5)
